import streamlit as st
import streamlit.components.v1 as components

def create_goal_section(number, goal, subdescription, iframe_url):
    st.markdown(f"### {number}. {goal}")
    st.markdown(f"_{subdescription}_")
    components.iframe(iframe_url, height=500)

st.title('Зорилт 5. Жендерийн эрх тэгш байдлыг хангах')
st.markdown('Жендэрийн тэгш байдлыг хангаж, бүх эмэгтэйчүүд, охидыг чадавхжуулах')
st.divider()

#JSON table
goals_data = {
  "goals_data": [
    {
      "number": "5.1",
      "goal": "2030 он гэхэд бүх эрэгтэй, эмэгтэй хүүхдүүдийг бага боловсролд бэлтгэж бага насны хүүхдүүдийг хөгжүүлэх чанартай үйлчилгээ, тусламж, сургуулийн өмнөх боловсролоор хангах",
      "subgoals": [
        {
          "number": "5.1.1",
          "description": "Эрүүл мэндийн байдал, сэтгэх, суралцах чадвар, нийгэм-сэтгэл зүйн хөгжлийн хувьд зөв төлөвшилд яваа 3-5 насны хүүхдүүдийн эзлэх хувь, хүйсээр",
          "iframe_url": "https://ourworldindata.org/grapher/proportion-of-children-developmentally-on-track"
        },
        {
          "number": "5.1.2",
          "description": "Сургуульд орох албан ёсны насанд хүрэхээс нэг жилийн өмнө зохион байгуулалттай сургалтад хамрагдагсдын эзлэх хувь, хүйсээр",
          "iframe_url": "https://ourworldindata.org/grapher/net-enrollment-rate-pre-primary"
        }
      ]
    },
    {
      "number": "5.2",
      "goal": "2030 он гэхэд бүх эрэгтэй, эмэгтэй хүнд хямд үнэтэй, чанартай техникийн, мэргэжлийн болон дээд боловсрол, түүний дотор их дээд сургуулийн боловсролыг тэгш авах боломжийг бүрдүүлэх",
      "subgoals": [
        {
          "number": "5.2.1",
          "description": "Сүүлийн 12 сарын хугацаанд албан болон албан бус боловсрол, сургалтад хамрагдсан насанд хүрэгчид, залуучуудын эзлэх хувь, хүйсээр",
          "iframe_url": "https://ourworldindata.org/grapher/participation-rate-in-formal-and-non-formal-education-and-training"
        }
      ]
    },
    {
      "number": "5.3",
      "goal": "2030 он гэхэд ажил эрхлэх, зохистой хөдөлмөр, хувийн бизнес эрхлэх холбогдох ур чадвартай, түүний дотор техник, мэргэжлийн ур чадвартай залуучууд, насан хүрэгсдийн тоош [x] хувиар нэмэгдүүлэх",
      "subgoals": [
        {
          "number": "5.3.1",
          "description": "Мэдээлэл харилцаа холбоо, технологийн ур чадвартай насанд хүрэгсэд болон залуучуудын эзлэх хувь, ур чадварын төрлөөр"
        }
      ]
    },
    {
      "number": "5.4",
      "goal": "2030 он гэхэд боловсролын байгууллагад суралцагсдын жендерийн зохистой харьцааг хангаж, эмзэг бүлэг, түүний дотор хөгжлийн бэрхшээлтэй хүмүүс, нутгийн уугуул хүмүүс, эмзэг бүлгийн хүүхдүүдэд бүх шатны боловсрол, мэргэжлийн сургалтыг тэгш авах боломжийг бүрдүүлэх",
      "subgoals": [
        {
          "number": "5.4.1",
          "description": "Энэ жагсаалтад орсон боловсролын бүх үзүүлэлтүүдээр задлан гаргаж болох Тэнцвэрийн индекс (эрэгтэй/эмэгтэй, хот/хөдөө орон нутгийн, баян чинээлэг/ядуу, доогуур орлоготой бүлэг болон хөгжлийн бэрхшээлтэй, мөргөлдөөнд өртсөн гэх зэрэг мэдээлэл өгөх боломжтой бусад үзүүлэлтээр)",
          "iframe_url": "https://ourworldindata.org/grapher/primary-completion-rate-adjusted-gender-parity-index"
        }
      ]
    },
    {
      "number": "5.5",
      "goal": "2030 он гэхэд бүх залуус, эрэгтэй, эмэгтэй нас хүрэгсдийн хамгийн багадаа [x] хувийг бичиг үсэг, тооны мэдлэгтэй болгох",
      "subgoals": [
        {
          "number": "5.5.1",
          "description": "Тухайн насны бүлгийн хүмүүсийн дотор (а) бичиг үсгийн болон (b) тоо тооллын анхан шатны үйлдлийн наад захын мэдлэг, чадвартай хүн амын эзлэх хувь, хүйсээр",
          "iframe_url": "https://ourworldindata.org/grapher/literacy-rate-of-young-men-and-women-line?country=~MNG"
        }
      ]
    },
    {
      "number": "5.6",
      "goal": "2030 он гэхэд тогтвортой хөгжлийн мэдлэг, тогтвортой амьдралын хэв маяг, хүний эрх, жендерийн тэгш байдал, энх тайван болон хүч үл хэрэглэх соёлыг төлөвшүүлэх, дэлхийн иргэн байх, соёлын олон янз байдал болон тогтвортой хөгжилд соёлын оруулж буй хувь нэмрийг ойлгуулах мэдүүлэх замаар тогтвортой хөгжлийг хөхүүлэх дэмжихэд шаардлагатай мэдлэг, ур чадварыг бүх суралцагчдад олгох",
      "subgoals": [
        {
          "number": "5.6.1",
          "description": "(i) Дэлхийн иргэний боловсрол жендерийн тэгш байдал, хүний эрхийн асуудлыг хамруулсан (ii)тогтвортой хөгжлийн боловсролыг (a) үндэсний боловсролын бодлого, (b) сургалтын хөтөлбөр, (c) багш нарын боловсрол болон (d) суралцагчийн үнэлгээнд тусгасан байдал",
          "iframe_url": "https://ourworldindata.org/grapher/mainstreaming-sustainable-development-into-teacher-education"
        }
      ]
    },
    {
      "number": "5.A",
      "goal": "Хүүхэд, хөгжлийн бэрхшээл, жендерийн мэдрэмжтэй боловсролын байгууллагыг бэхжүүлэн сайжруулж, хүн бүрийг аюулгүй, хүртээмжтэй, үр дүнтэй суралцах орчноор хангах",
      "subgoals": [
        {
          "number": "5.A.1",
          "description": "(a) Цахилгаан эрчим хүчинд холбогдсон; (b) сургалтын зорилгоор ашиглах интернеттэй; (c) сургалтын зорилгоор ашиглах компьютертэй; (d) хөгжлийн бэрхшээлтэй суралцагчдад зориулсан дэд бүтэц, ёургалтын материалаар хангагдсан, (e) ундны усаар хангагдсан; (f) эрэгтэй, эмэгтэй ариун цэврийн байгууламжтай; and (g) гар угаах өрөөтэй (WASH үзүүлэлтийн тодорхойлолтын дагуу) сургуулиудын эзлэх хувь",
          "iframe_url": "https://ourworldindata.org/grapher/schools-access-to-electricity?country=~MNG"
        }
      ]
    },
    {
      "number": "5.B",
      "goal": "2020 он гэхэд хөгжингүй болон хөгжиж буй бусад орнуудад дээд боловсрол, түүний дотор мэргэжлийн сургалт, мэдээлэл, харилцаа холбооны технологи, техникийн, инженерийн, шинжлэх ухааны сургалтад суралцуулах зорилгоор хөгжиж буй орнууд, ялангуяа нэн буурай хөгжилтэй болон жижиг арлын хөгжиж буй улс орнууд, Африкийн орнуудад олгох сургалтын тэтгэлгийн тоог дэлхийн хэмжээнд [x] хувиар нэмэгдүүлэх",
      "subgoals": [
        {
          "number": "5.B.1",
          "description": "Сургалтын тэтгэлэгт зориулсан хөгжлийн албан ёсны тусламжийн хэмжээ, салбараар болон сургалтын төрлөөр",
          "iframe_url": "https://ourworldindata.org/grapher/oda-for-scholarships"
        }
      ]
    },
    {
      "number": "5.C",
      "goal": "2030 он гэхэд хөгжиж буй орнууд, ялангуяа нэн буурай хөгжилтэй болон жижиг арлын хөгжиж буй улс орнуудад багш бэлтгэх сургалтын чиглэлийн олон улсын хамтын ажиллагаагаар дамжуулан дадлага туршлагатай багш нарын хангамжийг [x] хувиар нэмэгдүүлэх",
      "subgoals": [
        {
          "number": "5.C.1",
          "description": "Тухайн шатны сургуульд багшлах ур чадварын хамгийн бага шатны сургалтад багш болохоосоо өмнө болон багш болсны дараа хамрагдсан багш нарын эзлэх хувь (а) сургуулийн өмнөх, (b) бага, (c) дунд, (d) ахлах сургуулийн багш нарын дунд",
          "iframe_url": "https://ourworldindata.org/grapher/percentage-of-teachers-in-pre-primary-education-who-are-qualified"
        }
      ]
    }
  ]
}


def create_goal_section(number, goal, subgoals):
    st.markdown(f"### {number}. {goal}")
    for subgoal in subgoals:
        st.markdown(f"_{subgoal['number']}. {subgoal['description']}_")
        if 'iframe_url' in subgoal:
            components.iframe(subgoal['iframe_url'], height=500)
        else:
            st.markdown("Мэдээлэл байхгүй байна.")

for data in goals_data["goals_data"]:
    create_goal_section(
        number=data["number"],
        goal=data["goal"],
        subgoals=data["subgoals"]
    )

if st.button("Цэс рүү буцах"):
    st.switch_page("00_📌_Эхлэл.py")

st.divider()


st.write('All plots generated by Our World In Data are under CC-BY License of Fair Use.')
st.write('2024 © Green Dot Climate')