import streamlit as st
import streamlit.components.v1 as components

def create_goal_section(number, goal, subdescription, iframe_url):
    st.markdown(f"### {number}. {goal}")
    st.markdown(f"_{subdescription}_")
    components.iframe(iframe_url, height=500)

st.title('Зорилт 11. Ээлтэй хот иргэдийн оролцоог дэмжих')

st.write('Хот, хүн амын суурьшлыг бүх талын оролцоог хангасан, аюулгүй, эрсдлийг даван туулах чадвартай, тогтвортой болгох')

#JSON table
goals_data = [
  {
    "number": "11.1",
    "goal": "2030 он гэхэд хүрэлцэхүйц, аюулгүй, хямд үнэтэй орон сууц, суурь үйлчилгээгээр хүн бүрийг хангаж, ядуусын хорооллыг сайжруулах",
    "subgoals": [
      {
        "number": "11.1.1",
        "description": "Орон сууцны тохиромжгүй нөхцөл, зөвшөөрөлгүй бүсэд суурьшсан, урц, овоохойд амьдардаг хотын хүн амын эзлэх хувь",
        "iframe_url": "https://ourworldindata.org/grapher/share-of-urban-population-living-in-slums"
      }
    ]
  },
  {
    "number": "11.2",
    "goal": "2030 он гэхэд эмзэг бүлгийн хүн ам, эмэгтэйчүүд, хүүхэд, хөгжлийн бэрхшээлтэй болон өндөр настай хүмүүсийн хэрэгцээ шаардлагыг онцгой анхааран замын аюулгүй байдал, тухайлбал нийтийн тээврийг өргөжүүлэн сайжруулах замаар аюулгүй, хямд үнэтэй, хүртээмжтэй, тогтвортой тээврийн системийг хүн бүрт хүргэх",
    "subgoals": [
      {
        "number": "11.2.1",
        "description": "Нийтийн тээврээр ая тухтай зорчдог хүн амын эзлэх хувь, хүйсээр, насны бүлгээр, хөгжлийн бэрхшээлтэй иргэдээр",
        "iframe_url": "https://ourworldindata.org/grapher/share-with-convenient-access-to-public-transport"
      }
    ]
  },
  {
    "number": "11.3",
    "goal": "2030 он гэхэд бүх улс орнуудад хамтын оролцооны, нэгдсэн, тогтвортой хүн амын суурьшлын төлөвлөлт, менежментийн чадавх, бүх талын оролцоог хангасан, тогтвортой хот байгуулалтыг сайжруулах",
    "subgoals": [
      {
        "number": "11.3.1",
        "description": "Газар ашиглалтын хувийг хүн амын өсөлтийн хувьд харьцуулсан харьцаа"
      },
      {
        "number": "11.3.2",
        "description": "Хот төлөвлөлтөд иргэний нийгмийн шууд оролцоог бүрдүүлсэн, тогтмол, ардчилсан байдлаар үйл ажиллагаагаа явуулдаг удирдлага, төлөвлөлттэй хотуудын эзлэх хувь"
      }
    ]
  },
  {
    "number": "11.4",
    "goal": "Дэлхийн соёлын болон байгалийн өвийг хадгалан хамгаалах арга хэмжээг сайжруулах",
    "subgoals": [
      {
        "number": "11.4.1",
        "description": "Үндэсний соёл, байгалийн өвийг хадгалах, хамгаалахад зарцуулсан нэг хүнд ногдох нийт зардлын хэмжээ (төрийн болон хувийн), өвийн төрлөөр (Дэлхийн өвийн төв байгууллагын тодорхойлсноор соёлын, байгалийн, холимог гэх зэрэг), зардлын төрлөөр (үйл ажиллагааны зардал болон хөрөнгө оруулалт), хувийн санхүүжилтийн төрлөөр (биет болон биет бус хувийн ашгийн бус байгууллагад өгч буй хандивын төрөл, ивээн тэтгэгч), засаг захиргааны нэгжийн түвшинд"
      }
    ]
  },
  {
    "number": "11.5",
    "goal": "2030 он гэхэд нас барсан болон байгалийн гамшигт өртсөн хүмүүсийн тоог үлэмж хэмжээгээр бууруулж, ядуу болон эмзэг бүлгийн хүн амыг голлон анхаарч байгалийн гамшиг, түүний дотор устай холбоотой гамшгийн улмаас ДНБ-тай харьцуулсан эдийн засгийн алдагдлыг [x] хувиар бууруулах",
    "subgoals": [
      {
        "number": "11.5.1",
        "description": "100,000 хүнд ногдох гамшгийн улмаас амь насаа алдсан, сураггүй алга болсон болон гамшигт шууд нэрвэгдсэн хүний тоо",
        "iframe_url": "https://ourworldindata.org/grapher/deaths-and-missing-persons-due-to-natural-disasters"
      },
      {
        "number": "11.5.2",
        "description": "Дотоодын нийт бүтээгдэхүүнд гамшгаас үүдэлтэй эдийн засгийн шууд хохирлын эзлэх хувь (ДНБ), амин чухал дэд бүтцэд учруулсан гэмтэл, суурь үйлчилгээ тасалдсан тоо",
        "iframe_url": "https://ourworldindata.org/grapher/direct-disaster-loss-as-a-share-of-gdp"
      }
    ]
  },
  {
    "number": "11.6",
    "goal": "2030 он гэхэд агаарын чанар, хотын болон хог хаягдлын менежментийн асуудалд онцгой анхаарлаа хандуулах замаар хотуудын нэг хүнд ногдох байгаль орчны сөрөг нөлөөллийг бууруулах",
    "subgoals": [
      {
        "number": "11.6.1",
        "description": "Хот суурин газарт тогтмол цуглуулдаг хатуу хог хаягдал, түүнээс хот суурин газарт бий болсон хатуу хог хаягдлаас эцсийн боловсруулалт хийгдсэн хатуу хог хаягдын эзлэх хувь, хотоор"
      },
      {
        "number": "11.6.2",
        "description": "Хотын агаар дахь нарийн болон том ширхэглэгт тоосонцрын (өөрөөр хэлбэл, PM 2.5 болон PM 10) жилийн дундаж хэмжээ (хүн амд харьцуулсан)",
        "iframe_url": "https://ourworldindata.org/grapher/pm25-air-pollution"
      }
    ]
  },
  {
    "number": "11.7",
    "goal": "2030 он гэхэд хүн бүрийг, ялангуяа эмэгтэйчүүд, хүүхдүүд, өндөр настнууд, хөгжлийн бэрхшээлтэй хүмүүсийг аюулгүй, бүх талын оролцоог хангасан, хүртээмжтэй, ногоон болон нийтийн эзэмшлийн талбайгаар хангах",
    "subgoals": [
      {
        "number": "11.7.1",
        "description": "Бүх нийтийн хэрэгцээнд зориулсан задгай талбайтай барилгажуулсан газрын эзлэх дундаж хувь, хүйсээр, насны бүлгээр, хөгжлийн бэрхшээлтэй хүн амаар"
      },
      {
        "number": "11.7.2",
        "description": "Сүүлийн 12 сард бие махбодын хохирол амссан, бэлгийн дарамтад орсон хүн амын эзлэх хувь, хүйсээр, насны бүлгээр, хөгжлийн бэрхшээлтэй хүн амаар, хэрэг гарсан байршлаар"
      }
    ]
  },
  {
    "number": "11.a",
    "goal": "Үндэсний болон бүс нутгийн хөгжлийн төлөвлөлтийг сайжруулах замаар хот, хагас суурин газар, хөдөө орон нутгийн хооронд эдийн засаг, нийгэм, байгаль орчны үр дүнтэй уялдаа холбоо дэмжих",
    "subgoals": [
      {
        "number": "11.a.1",
        "description": "Хүн амын хэтийн тооцоо болон хэрэгцээт нөөц боломжтой уялдуулсан хот, бүсийн хөгжлийн төлөвлөгөөг хэрэгжүүлдэг, хотод амьдардаг хүн амын эзлэх хувь, хотын хэмжээгээр",
        "iframe_url": "https://ourworldindata.org/grapher/urban-policies-population-dynamics"
      }
    ]
  },
  {
    "number": "11.b",
    "goal": "2020 он гэхэд бүх талын оролцоог хангах, хөрөнгө баялгийг үр ашигтай ашиглах, уур амьсгалын өөрчлөлтийг бууруулах, дасан зохицох, гамшгийг даван туулах чадварыг бэхжүүлэхэд чиглэсэн нэгдсэн бодлого, төлөвлөгөө батлан хэрэгжүүлдэг хот, хүн амын суурьшлын тоог [x] хувиар нэмэгдүүлж, удахгүй гарах Хёгогийн үйл ажиллагааны баримт бичигтэй уялдуулан бүх түвшинд гамшгийн эрсдэлийн цогц менежментийг боловсруулж, хэрэгжүүлэх",
    "subgoals": [
      {
        "number": "11.b.1",
        "description": " Гамшгийн эрсдэлийг бууруулах чиглэлээр 2015-2030 онд авч хэрэгжүүлэх Сендайн үйл ажиллагааны суурь баримт бичигтэй уялдуулсан гамшгийн эрсдэлийг бууруулах үндэсний стратегийг баталж, хэрэгжүүлдэг эсэх",
        "iframe_url": "https://ourworldindata.org/grapher/countries-with-legislative-regulatory-provisions-for-managing-disaster-risk"
      },
      {
        "number": "11.b.2",
        "description": "Гамшгийн эрсдлийг бууруулах үндэсний стратегийн дагуу гамшгийн эрсдлийг бууруулах орон нутгийн стратегийг баталж, хэрэгжүүлдэг эсэх",
        "iframe_url": "https://ourworldindata.org/grapher/local-gov-disaster-strategies"
      }
    ]
  },
  {
    "number": "11.c",
    "goal": "2030 он гэхэд үйл ажиллагаагаа хэмнэх, гамшгийг даван туулах, эмнэлгийн үйлчилгээг нийцэхэд холбогдох, гамшигийн эрсдэл, эмнэлгийн эсрэг хороолол, үйлчилгээг хэмнэхэд бага зэргээр нийцэж, удахгүйгээр төлөвлөгөө батлан хэрэгжүүлэхийг зориулан салбар бүрийн бүтээгдэхүүнд, үйл ажиллагааны чадварыг үргэлжлүүлэхийг зориулан аюулгүй, хүртээмжтэй гамшгийн эрсдэлийг бууруулахад чиглэсэн нийцэлт байдал, холбогдох үйл ажиллагаа, эмнэлгийн үйлчилгээг хэмнэх",
    "subgoals": [
      {
        "number": "11.c.1",
        "description": "Эмнэлгийн бүтээгдэхүүний, үйл ажиллагааны, үйлчилгээний дагуу үйл ажиллагааны чадварыг үргэлжлүүлэхийг зориулан гамшигийн эрсдэлд хариуцлага үйлдэл хийгдсэн эмнэлгийн тоо"
      }
    ]
  }
]

 

def create_goal_section(number, goal, subgoals):
    st.markdown(f"### {number}. {goal}")
    for subgoal in subgoals:
        st.markdown(f"_{subgoal['number']}. {subgoal['description']}_")
        if 'iframe_url' in subgoal:
            components.iframe(subgoal['iframe_url'], height=500)
        else:
            st.markdown("Мэдээлэл байхгүй байна.")

for data in goals_data:
    create_goal_section(
        number=data["number"],
        goal=data["goal"],
        subgoals=data["subgoals"]
    )

st.divider()

st.markdown("<p style='text-align: center; color: black;'>All plots generated by Our World In Data are under CC-BY License of Fair Use.</p>", unsafe_allow_html=True)
st.markdown("<p style='text-align: center; color: black;'>2024 © Green Dot Climate</p>", unsafe_allow_html=True)