import streamlit as st
import streamlit.components.v1 as components

def create_goal_section(number, goal, subdescription, iframe_url):
    st.markdown(f"### {number}. {goal}")
    st.markdown(f"_{subdescription}_")
    components.iframe(iframe_url, height=500)

st.title('Зорилт 17. Хөгжлийн төлөөх түншлэлийг бэхжүүлэх')

st.write('Тогтвортой хөгжлийн төлөө дэлхий нийтийн түншлэлийг сэргээж, түүнийг хэрэгжүүлэх арга замыг сайжруулах')
st.divider()
#JSON table
goals_data = [
    {
        "number": "17.1",
        "goal": "Татвар, бусад орлого цуглуулах үндэсний чадавхыг бэхжүүлэх зорилгоор хөгжиж буй орнуудад олон улсын тусламж дэмжлэг үзүүлэх замаар хөрөнгө мөнгө бүрдүүлэх үндэсний үйл ажиллагааг сайжруулах",
        "subgoals": [
            {
                "number": "17.1.1",
                "description": "ДНБ-д эзлэх төсвийн нийт орлого, эх үүсвэрээр",
                "iframe_url": "https://ourworldindata.org/grapher/government-revenues-as-a-share-of-gdp-imf"
            },
            {
                "number": "17.1.2",
                "description": "Орон нутгийн төсөвт орон нутгын татварын эзлэх хувь",
                "iframe_url": "https://ourworldindata.org/grapher/share-of-central-government-expenditures-funded-by-taxes"
            }
        ]
    },
    {
        "number": "17.2",
        "goal": "Хөгжингүй орнуудын хөгжлийн албан ёсны тусламж үзүүлэх үүрэг амлалтыг нь бүрэн биелүүлэх, ялангуяа үндэсний нийт орлогынхоо 0.7 хувийг хөгжиж буй орнуудад, үүнээс 0.15-аас 0.20 хүртэлх хувийг нэн буурай хөгжилтэй улс орнуудад өгөх",
        "subgoals": [
            {
                "number": "17.2.1",
                "description": "ЭЗХАХБ, Хөгжлийн тусламжийн хорооны (DAC) донор орнуудын үндэсний нийт орлогод эзлэх буурай хөгжилтэй орнуудад үзүүлж буй хөгжлийн албан ёсны цэвэр болон нийт тусламжийн дүн"
            }
        ]
    },
    {
        "number": "17.3",
        "goal": "Төрөл бүрийн эх үүсвэрээс хөгжиж буй орнуудад зориулан нэмэлт санхүүгийн хөрөнгө бүрдүүлэх",
        "subgoals": [
            {
                "number": "17.3.1",
                "description": "Гадаадын шууд хөрөнгө оруулалт болон Хөгжлийн албан ёсны тусламж, Өмнөд-Өмнөдийн хамтын ажиллагааны улсын нийт төсөвт эзлэх хувь",
                "iframe_url": "https://ourworldindata.org/grapher/foreign-direct-investment-net-outflows-as-share-of-gdp"
            },
            {
                "number": "17.3.2",
                "description": "ДНБ-нд эзлэх мөнгөн гуйвуулгын хэмжээ, ам.доллараар",
                "iframe_url": "https://ourworldindata.org/explorers/migration?facet=none&country=~OWID_WRL&hideControls=true&Metric=Remittances+received+%28%25+of+GDP%29"
            }
        ]
    },
    {
        "number": "17.4",
        "goal": "Өрөө санхүүжүүлэх, өрийн дарамтыг бууруулах, өрийн бүтцэдээ өөрчлөлт хийх ажиллагааг хөхүүлэн дэмжихэд чиглэсэн нэгдсэн зохицуулалт бүхий бодлогоор дамжуулан урт хугацааны өрийн тогтвортой байдлыг бий болгоход нь хөгжиж буй орнуудын туслах",
        "subgoals": [
            {
                "number": "17.4.1",
                "description": "Бараа, үйлчилгээний экспорт дахь Өрийн үйлчилгээний эзлэх хувь",
                "iframe_url": "https://ourworldindata.org/grapher/debt-service-of-exports-of-goods-services"
            }
        ]
    },
    {
        "number": "17.5",
        "goal": "Нэн буурай хөгжилтэй орнуудад хөрөнгө оруулалт хөхүүлэн дэмжих журмыг нэвтрүүлж, хэрэгжүүлэх",
        "subgoals": [
            {
                "number": "17.5.1",
                "description": "Буурай хөгжилтэй орнуудад зориулсан хөрөнгө оруулалтыг дэмжих дүрэм, журмыг баталсан улс орнуудын тоо",
                "iframe_url": "https://ourworldindata.org/grapher/countries-with-a-signed-bilateral-investment-treaty?country=~Developing+regions"
            }
        ]
    },
    {
        "number": "17.6",
        "goal": "Одоо ашиглагдаж буй механизм, ялангуяа НҮБ-ын түвшинд хэрэглэгдэж буй механизмууд хоорондын уялдаа холбоог сайжруулах замаар, харилцан тохиролцсон нөхцөлд технологийг хөнгөвчлөх дэлхийн механизмаар дамжуулан шинжлэх ухаан, технологи, инновацийн чиглэлийн Хойд-Өмнөд, Өмнөд-Өмнөдийн болон гурван талт олон улс, бүсийн хамтын ажиллагааг, тэдгээрийг ашиглах боломжийг нэмэгдүүлэх, харилцан тохиролцсоны үндсэн дээр мэдлэг солилцох ажиллагааг сайжруулах",
        "subgoals": [
            {
                "number": "17.6.1",
                "description": "Улс орнуудын хооронд байгуулсан шинжлэх ухаан болон технологийн хамтын ажиллагааны гэрээ, хөтөлбөрийн тоо, хамтын ажиллагааны хэлбэрээр",
                "iframe_url": "https://ourworldindata.org/grapher/broadband-penetration-by-country?tab=chart&country=~MNG"
            },
            {
                "number": "17.6.2",
                "description": "100 оршин суугчдад ногдох суурин интернетийн өргөн зурвас, хурдаар",
                "iframe_url": "https://ourworldindata.org/grapher/broadband-penetration-by-country?tab=chart&country=~MNG"
            }
        ]
    },
    {
        "number": "17.7",
        "goal": "Харилцан тохиролцсоны үндсэн дээр таатай нөхцөлөөр, түүний дотор хөнгөлөлттэй нөхцөлөөр хөгжиж буй орнуудад байгаль орчинд ээлтэй технологийн хөгжүүлэх, шилжүүлэх, түгээх ажлыг хөхүүлэн дэмжих",
        "subgoals": [
            {
                "number": "17.7.1",
                "description": "Хөгжиж буй орнуудад байгаль орчинд ээлтэй технологийг хөгжүүлэх, дамжуулах, тараах болон тархцыг дэмжихээр батлагдсан санхүүжилтийн нийт дүн",
                "iframe_url": "https://ourworldindata.org/grapher/export-of-environmentally-sound-technologies"
            }
        ]
    },
    {
        "number": "17.8",
        "goal": "2017 онд гэхэд нэн буурай хөгжилтэй орнуудад зориулсан технологийн банк, шинжлэх ухаан, технологи, инновацийн чадавх бэхжүүлэх механизмыг бүрэн ажилд оруулж, технологи, ялангуяа мэдээлэл, харилцаа холбооны технологийн ашиглалтыг нэмэгдүүлэх",
        "subgoals": [
            {
                "number": "17.8.1",
                "description": "Интернет ашигладаг хувь хүмүүсийн ​​эзлэх хувь",
                "iframe_url": "https://ourworldindata.org/grapher/share-of-individuals-using-the-internet?country=~MNG"
            }
        ]
    },
    {
        "number": "17.9",
        "goal": "Хойд-Өмнөд, Өмнөд-Өмнөдийн болон гурван талт хамтын ажиллагаагаар дамжуулан тогтвортой хөгжлийн бүх зорилтуудыг хэрэгжүүлэх үндэсний хөтөлбөрүүдийг дэмжиж хөгжиж буй орнуудад үр дүнтэй, зорилтот чадавх бэхжүүлэх арга хэмжээг хэрэгжүүлэхэд чиглэсэн олон улсын дэмжлэгийг нэмэгдүүлэх",
        "subgoals": [
            {
                "number": "17.9.1",
                "description": "Хөгжиж буй орнуудын санхүүгийн болон техникийн тусламжийн дүн, доллараар (Хойд-Өмнөд, Өмнөд-Өмнөд болон гурвал талт хамтын ажиллагааны хүрээнд)",
                "iframe_url": "https://ourworldindata.org/grapher/total-official-development-assistance-for-technical-cooperation"
            }
        ]
    },
    {
        "number": "17.10",
        "goal": "Дохагийн хөгжлийн хөтөлбөрийн хүрээнд хийгдэж буй хэлэлцээг эцэслэн дуусгах замаар Дэлхийн худалдааны байгууллагын харьяанд дэлхий нийтийн, дүрэм журамд үндэслэсэн, нээлттэй, үл ялгаварласан, эрх тэгш олон улсын худалдааны системийг дэмжин хөгжүүлэх",
        "subgoals": [
            {
                "number": "17.10.1",
                "description": "Дэлхийн жигнэсэн тарифын дундаж",
                "iframe_url": "https://ourworldindata.org/grapher/tariff-rate-applied-weighted-mean-all-products?country=~MNG"
            }
        ]
    },
    {
        "number": "17.11",
        "goal": "2020 он гэхэд нэн буурай хөгжилтэй орнуудын дэлхийн экспортод эзлэх хувийг дахин нэмэгдүүлэх зорилгоор хөгжиж буй орнуудын экспортыг үлэмж хэмжээгээр нэмэгдүүлэх",
        "subgoals": [
            {
                "number": "17.11.1",
                "description": "Хөгжиж буй болон нэн буурай хөгжилтэй орнуудын экспортын дэлхийн экспортод эзлэх хувь",
                "iframe_url": "https://ourworldindata.org/grapher/share-of-global-merchandise-exports?country=~MNG"
            }
        ]
    },
    {
        "number": "17.12",
        "goal": "Нэн буурай хөгжилтэй орнуудын импортод үйлчилдэг гарал үүслийн хөнгөлөлттэй дүрмийг ил тод, тодорхой болгох замаар Дэлхийн худалдааны байгууллагын шийдвэрт нийцсэн нэн буурай хөгжилтэй бүх орнуудад урт хугацаанд үргэлжлэх татваргүй, квотгүй зах зээлийн гарцыг бий болгох ажлыг шуурхай хэрэгжүүлж, зах зээлд нэвтрэх боломжийг нэмэгдүүлэх",
        "subgoals": [
            {
                "number": "17.12.1",
                "description": "Хөгжиж буй орнууд, нэн буурай хөгжилтэй болон хөгжиж буй жижиг арлын орнуудад тулгарч байгаа дундаж үнэ тариф",
                "iframe_url": "https://ourworldindata.org/grapher/tariff-rates?country=~MNG"
            }
        ]
    },
    {
        "number": "17.13",
        "goal": "Бодлогын зохицуулалт, уялдаа холбоог хангах замаар дэлхийн макро эдийн засгийн тогтвортой байдлыг бэхжүүлэх",
        "subgoals": [
            {
                "number": "17.13.1",
                "description": "Макро эдийн засгийн үзүүлэлтүүд",
                "iframe_url": "https://ourworldindata.org/grapher/inflation-of-consumer-prices"
            }
        ]
    },
    {
        "number": "17.14",
        "goal": "Тогтвортой хөгжлийн бодлогын уялдаа холбоог сайжруулах",
        "subgoals": [
            {
                "number": "17.14.1",
                "description": "Тогтвортой хөгжүүлэх бодлогын уялдааг сайжруулах механизмыг бүрдүүлсэн эсэх"
            }
        ]
    },
    {
        "number": "17.15",
        "goal": "Ядуурлыг арилгах, тогтвортой хөгжлийн бодлого тогтоох, хэрэгжүүлэх чиглэлээр ажиллаж байгаа аливаа улс орны бодлогын орон зай, манлайллыг хүндэтгэх",
        "subgoals": [
            {
                "number": "17.15.1",
                "description": "Монгол Улсын үр дүнгийн тогтолцоо, төлөвлөлтийн арга хэрэгслийг хөгжлийн хамтын ажиллагааны байгууллагууд ашиглаж байгаа байдал",
                "iframe_url": "https://ourworldindata.org/grapher/use-of-crf-tools-by-providers-of-dev-cooperation?country=~MNG"
            }
        ]
    },
    {
        "number": "17.16",
        "goal": "Бүх улс орнуудад, ялангуяа хөгжиж буй орнуудад тогтвортой хөгжлийн зорилтуудад хүрэх ажлыг дэмжиж мэдлэг, мэргэшсэн чадвар, технологи солилцох, санхүүгийн эх үүсвэр бүрдүүлэх олон талт түншлэлтэй хослуулан тогтвортой хөгжлийн төлөө дэлхийн түншлэлийг бэхжүүлэх",
        "subgoals": [
            {
                "number": "17.16.1",
                "description": "Тогтвортой хөгжлийн зорилгод хүрэхэд дэмжлэг болдог хөгжлийн үр ашигтай байдлын хяналт шинжилгээний олон талт оролцогчдын тогтолцоог бүрдүүлэх чиглэлд хийж байгаа ажлаа тайлагнаж байгаа эсэх"
            }
        ]
    },
    {
        "number": "17.17",
        "goal": "Түншлэлийн хүрээнд олж авсан туршлага, хөрөнгө мөнгөө зарцуулсан бодлогод түшиглэн төр, төр-хувийн хэвшил болон иргэний нийгмийн үр дүнтэй түншлэлийг хөхүүлэн дэмжиж, төлөвшүүлэх",
        "subgoals": [
            {
                "number": "17.17.1",
                "description": "Төр, хувийн хэвшил, иргэний нийгмийн хамтын ажиллагааг дэмжихээр амласан дүн, ам.доллараар"
            }
        ]
    },
    {
        "number": "17.18",
        "goal": "2020 он гэхэд орлого, жендер, нас, арьс өнгө, үндэс угсаа, шилжин суурьшилтын байдал, хөгжлийн бэрхшээл, газар зүйн байрлал, үндэсний онцлог бүхий бусад үзүүлэлтээр ангилан гаргасан өндөр чанартай, шуурхай, найдвартай тоо мэдээллийн хүртээмжийг үлэмж хэмжээгээр нэмэгдүүлэх зорилгоор хөгжиж буй орнууд, түүний дотор нэн буурай хөгжилтэй, жижиг арлын хөгжиж буй орнуудад үзүүлж буй чадавх бэхжүүлэх дэмжлэг туслалцааг сайжруулах",
        "subgoals": [
            {
                "number": "17.18.1",
                "description": "Албан ёсны статистикийн үндсэн зарчмын дагуу холбогдох зорилтоор улсын түвшинд бүх задаргаагаар гардаг тогтвортой хөгжлийн шалгуур үзүүлэлтүүдийн эзлэх хувь"
            },
            {
                "number": "17.18.2",
                "description": "Албан ёсны статистикийн үндсэн зарчмыг тусгасан статистикийн хууль тогтоомжтой эсэх",
                "iframe_url": "https://ourworldindata.org/grapher/national-statistical-legislation"
            },
            {
                "number": "17.18.3",
                "description": "Бүрэн санхүүжилттэй эсвэл хэрэглэгчид зарцуулах зорилгоор тээвэрлэх арга хэмжээг төлөөлөх",
                "iframe_url": "https://ourworldindata.org/grapher/countries-with-stats-plan-funded-by-source?country=~MNG"
            }
        ]
    },
    {
        "number": "17.19",
        "goal": "2030 он гэхэд тогтвортой хөгжилд хүрэх чиглэлээр гарч буй ахиц дэвшлийг тооцох одоогийн санаачилгуудад түшиглэн хөгжиж буй орнуудын статистикийн чадавхыг бэхжүүлэх ажлыг дэмжих",
        "subgoals": [
            {
                "number": "17.19.1",
                "description": "Хөгжлийн баримтлалыг адилхан байдлаар, тэдгээрийн нэгдмэл харилцааны хамтран ажиллаж хэвшил тэмдэглэх",
                "iframe_url": "https://ourworldindata.org/grapher/resources-statistical-capacity"
            },
            {
                "number": "17.19.2",
                "description": "(a) Сүүлийн 10 жилд хүн ам, орон сууцны тооллогыг наад зах нь 1 удаа зохион байгуулсан, (b) нас баралтын бүртгэлийг 80%, төрөлтийн бүртгэлийг 100% -д хүргэсэн эсэх",
                "iframe_url": "https://ourworldindata.org/grapher/population-census-world-bank"
            }
        ]
    }
]

 

def create_goal_section(number, goal, subgoals):
    st.markdown(f"### {number}. {goal}")
    for subgoal in subgoals:
        st.markdown(f"_{subgoal['number']}. {subgoal['description']}_")
        if 'iframe_url' in subgoal:
            components.iframe(subgoal['iframe_url'], height=500)
        else:
            st.markdown("Мэдээлэл байхгүй байна.")

for data in goals_data:
    create_goal_section(
        number=data["number"],
        goal=data["goal"],
        subgoals=data["subgoals"]
    )
if st.button("Цэс рүү буцах"):
    st.switch_page("00_📌_Эхлэл.py")

st.divider()

st.write('All plots generated by Our World In Data are under CC-BY License of Fair Use.')
st.write('2024 © Green Dot Climate')